# RegenerationFailedException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RegenerationFailedException Class
Members See Also
---
The exception that is thrown when a regeneration operation failed.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class RegenerationFailedException : InvalidOperationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class RegenerationFailedException _
	Inherits InvalidOperationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class RegenerationFailedException : public InvalidOperationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..InvalidOperationException Autodesk.Revit.Exceptions..::..RegenerationFailedException
# See Also
RegenerationFailedException Members
Autodesk.Revit.Exceptions Namespace